app/views/states/_form.html.erb

SELECT "countries".* FROM "countries"
---
    <!--<%= f.number_field :country_id %>-->
    <%= collection_select(:state, :country_id, Country.all, :id, :name, prompt: true) %>