app/controllers/cities_controller.rb

  def create
    @city = City.new(city_params)

    respond_to do |format|
      if @city.save
---
INSERT INTO "cities" ("name", "country_id", "state_id", "description", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["name", "bangalore"], ["country_id", 1], ["state_id", 3], ["description", "IT industrialist"], ["created_at", "2015-05-23 14:55:27.875116"], ["updated_at", "2015-05-23 14:55:27.875116"]]