app/controllers/states_controller.rb

  def index
    @states = State.all
---
SELECT "states".* FROM "states"

  def create
    @state = State.new(state_params)

    respond_to do |format|
      if @state.save
---
INSERT INTO "states" ("name", "country_id", "description", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "delhi"], ["country_id", 1], ["description", "love resides"], ["created_at", "2015-05-23 14:00:07.053784"], ["updated_at", "2015-05-23 14:00:07.053784"]]

    def set_state
      @state = State.find(params[:id])
---
SELECT  "states".* FROM "states" WHERE "states"."id" = ? LIMIT 1  [["id", 1]]