app/views/cities/_form.html.erb

SELECT "countries".* FROM "countries"
---
    <!--<%= f.number_field :country_id %>-->
    <%= collection_select(:city, :country_id, Country.all, :id, :name, prompt: true) %>

SELECT "states".* FROM "states"
---
    <!--<%= f.number_field :state_id %>-->
    <%= collection_select(:city, :state_id, State.all, :id, :name, prompt: true) %>